### pandas & numpy learning

In [2]:
import pandas as pd

[coursera](https://www.coursera.org/lecture/data-analysis-with-python/getting-started-analyzing-data-in-python-9jjM3)

In [24]:
url = "laptop_prices.csv"
data = pd.read_csv(url, header= None)
data

    0   1   2
0  30  21   9
1  35  34   1
2  41  11  11

In [25]:
data.head(2)

    0   1  2
0  30  21  9
1  35  34  1

In [26]:
data.tail(2)

    0   1   2
1  35  34   1
2  41  11  11

In [29]:
head = ["ProductA","ProductB","ProductC"]
data.columns = head
data

   ProductA  ProductB  ProductC
0        30        21         9
1        35        34         1
2        41        11        11

In [19]:
data.to_csv("laptop_prices.csv")

In [28]:
data.describe()

        ProductA   ProductB   ProductC
count   3.000000   3.000000   3.000000
mean   35.333333  22.000000   7.000000
std     5.507571  11.532563   5.291503
min    30.000000  11.000000   1.000000
25%    32.500000  16.000000   5.000000
50%    35.000000  21.000000   9.000000
75%    38.000000  27.500000  10.000000
max    41.000000  34.000000  11.000000